---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.MEPBuildingConstructionSet.IsEmpty
source: html/8b6d2c01-2351-3437-3385-3eba07bde4be.htm
---
# Autodesk.Revit.DB.Mechanical.MEPBuildingConstructionSet.IsEmpty Property

Test to see if the set is empty.

## Syntax (C#)
```csharp
public virtual bool IsEmpty { get; }
```

## Remarks
If the set is empty then True will be returned, otherwise False.